
### leverage terraform apply
```
[14:31:46]    INFO	Attempting to get temporary credentials for apps-devstg account.
[14:31:48]    INFO	Using already configured temporary credentials.
[14:31:48]    INFO	Attempting to get temporary credentials for shared account.
[14:31:51]    INFO	Using already configured temporary credentials.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # mysql_database.sockshop will be created
  + resource "mysql_database" "sockshop" {
      + default_character_set = "utf8"
      + default_collation     = "utf8_general_ci"
      + id                    = (known after apply)
      + name                  = "socksdb"
    }

  # mysql_grant.sockshop will be created
  + resource "mysql_grant" "sockshop" {
      + database   = "socksdb"
      + grant      = false
      + host       = "%"
      + id         = (known after apply)
      + privileges = [
          + "CREATE",
          + "DELETE",
          + "DROP",
          + "INSERT",
          + "REFERENCES",
          + "SELECT",
          + "UPDATE",
        ]
      + table      = "*"
      + tls_option = "NONE"
      + user       = "catalogue_user"
    }

  # mysql_user.sockshop will be created
  + resource "mysql_user" "sockshop" {
      + host               = "%"
      + id                 = (known after apply)
      + plaintext_password = (sensitive value)
      + tls_option         = "NONE"
      + user               = "catalogue_user"
    }

  # random_password.sockhsop will be created
  + resource "random_password" "sockhsop" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 30
      + lower       = true
      + min_lower   = 8
      + min_numeric = 8
      + min_special = 0
      + min_upper   = 8
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.demoapps.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster bb-apps-devstg-binbash-aurora-mysql"
      + id          = (known after apply)
      + name        = "bb-apps-devstg-binbash-aurora-mysql"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-05XXXXXXXXXX5e5",
          + "subnet-09XXXXXXXXXX80",
          + "subnet-0cXXXXXXXXXXa3",
        ]
      + tags        = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "aurora-demo"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + tags_all    = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "aurora-demo"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
    }

  # module.demoapps.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage                   = (known after apply)
      + allow_major_version_upgrade         = false
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backup_retention_period             = 1
      + cluster_identifier                  = "bb-apps-devstg-binbash-aurora-mysql"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = "demoapps"
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "bb-apps-devstg-binbash-aurora-mysql"
      + enable_global_write_forwarding      = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-mysql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "5.7"
      + engine_version_actual               = (known after apply)
      + final_snapshot_identifier           = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "admin"
      + port                                = 3306
      + preferred_backup_window             = "14:00-15:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + tags                                = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "aurora-demo"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + tags_all                            = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "aurora-demo"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + vpc_security_group_ids              = (known after apply)

      + timeouts {}
    }

  # module.demoapps.aws_rds_cluster_instance.this["one"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "bb-apps-devstg-binbash-aurora-mysql"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "bb-apps-devstg-binbash-aurora-mysql-one"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "aurora-demo"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + tags_all                              = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "aurora-demo"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.demoapps.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Control traffic to/from RDS Aurora bb-apps-devstg-binbash-aurora-mysql"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bb-apps-devstg-binbash-aurora-mysql-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "bb-apps-devstg-binbash-aurora-mysql"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + tags_all               = {
          + "Environment"        = "apps-devstg"
          + "Name"               = "bb-apps-devstg-binbash-aurora-mysql"
          + "ScheduleStartDaily" = "true"
          + "ScheduleStopDaily"  = "true"
          + "Terraform"          = "true"
        }
      + vpc_id                 = "vpc-07XXXXXXXXX95"
    }

  # module.demoapps.aws_security_group_rule.cidr_ingress[0] will be created
  + resource "aws_security_group_rule" "cidr_ingress" {
      + cidr_blocks              = [
          + "10.X.X.0/16",
          + "172.X.X.0/20",
        ]
      + description              = "From allowed CIDRs"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.demoapps.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "bb-apps-devstg-binbash-aurora-mysql"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_database_name           = "demoapps"
  + cluster_endpoint                = (known after apply)
  + cluster_id                      = (known after apply)
  + cluster_instances               = {
      + one = {
          + apply_immediately                     = true
          + arn                                   = (known after apply)
          + auto_minor_version_upgrade            = true
          + availability_zone                     = (known after apply)
          + ca_cert_identifier                    = (known after apply)
          + cluster_identifier                    = (known after apply)
          + copy_tags_to_snapshot                 = false
          + db_parameter_group_name               = (known after apply)
          + db_subnet_group_name                  = "bb-apps-devstg-binbash-aurora-mysql"
          + dbi_resource_id                       = (known after apply)
          + endpoint                              = (known after apply)
          + engine                                = "aurora-mysql"
          + engine_version                        = "5.7"
          + engine_version_actual                 = (known after apply)
          + id                                    = (known after apply)
          + identifier                            = "bb-apps-devstg-binbash-aurora-mysql-one"
          + identifier_prefix                     = (known after apply)
          + instance_class                        = "db.t3.small"
          + kms_key_id                            = (known after apply)
          + monitoring_interval                   = 0
          + monitoring_role_arn                   = (known after apply)
          + performance_insights_enabled          = (known after apply)
          + performance_insights_kms_key_id       = (known after apply)
          + performance_insights_retention_period = (known after apply)
          + port                                  = (known after apply)
          + preferred_backup_window               = (known after apply)
          + preferred_maintenance_window          = "sun:05:00-sun:06:00"
          + promotion_tier                        = 0
          + publicly_accessible                   = false
          + storage_encrypted                     = (known after apply)
          + tags                                  = {
              + "Environment"        = "apps-devstg"
              + "Name"               = "aurora-demo"
              + "ScheduleStartDaily" = "true"
              + "ScheduleStopDaily"  = "true"
              + "Terraform"          = "true"
            }
          + tags_all                              = {
              + "Environment"        = "apps-devstg"
              + "Name"               = "aurora-demo"
              + "ScheduleStartDaily" = "true"
              + "ScheduleStopDaily"  = "true"
              + "Terraform"          = "true"
            }
          + timeouts                              = {
              + create = null
              + delete = null
              + update = null
            }
          + writer                                = (known after apply)
        }
    }
  + cluster_master_password         = (sensitive value)
  + cluster_master_username         = (sensitive value)
  + cluster_port                    = 3306
  + cluster_reader_endpoint         = (known after apply)
  + cluster_resource_id             = (known after apply)
  + demoapps_sockshop_database_name = "socksdb"
  + demoapps_sockshop_password      = (sensitive value)
  + demoapps_sockshop_username      = "catalogue_user"
  + security_group_id               = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.demoapps.random_id.snapshot_identifier[0]: Creating...
module.demoapps.random_id.snapshot_identifier[0]: Creation complete after 0s [id=mu8wfQ]
random_password.sockhsop: Creating...
random_password.sockhsop: Creation complete after 0s [id=none]
module.demoapps.aws_security_group.this[0]: Creating...
module.demoapps.aws_db_subnet_group.this[0]: Creating...
module.demoapps.aws_db_subnet_group.this[0]: Creation complete after 3s [id=bb-apps-devstg-binbash-aurora-mysql]
module.demoapps.aws_security_group.this[0]: Creation complete after 4s [id=sg-0cXXXXXXXXXXa5]
module.demoapps.aws_security_group_rule.cidr_ingress[0]: Creating...
module.demoapps.aws_rds_cluster.this[0]: Creating...
module.demoapps.aws_security_group_rule.cidr_ingress[0]: Creation complete after 1s [id=sgrule-51XXXXX11]
module.demoapps.aws_rds_cluster.this[0]: Still creating... [10s elapsed]
module.demoapps.aws_rds_cluster.this[0]: Still creating... [20s elapsed]
.
.
.
module.demoapps.aws_rds_cluster.this[0]: Still creating... [1m30s elapsed]
module.demoapps.aws_rds_cluster.this[0]: Still creating... [1m40s elapsed]
module.demoapps.aws_rds_cluster.this[0]: Creation complete after 1m45s [id=bb-apps-devstg-binbash-aurora-mysql]
module.demoapps.aws_rds_cluster_instance.this["one"]: Creating...
module.demoapps.aws_rds_cluster_instance.this["one"]: Still creating... [10s elapsed]
module.demoapps.aws_rds_cluster_instance.this["one"]: Still creating... [20s elapsed]
module.demoapps.aws_rds_cluster_instance.this["one"]: Still creating... [30s elapsed]
.
.
.
module.demoapps.aws_rds_cluster_instance.this["one"]: Still creating... [5m0s elapsed]
module.demoapps.aws_rds_cluster_instance.this["one"]: Still creating... [5m10s elapsed]
module.demoapps.aws_rds_cluster_instance.this["one"]: Creation complete after 5m11s [id=bb-apps-devstg-binbash-aurora-mysql-one]
mysql_database.sockshop: Creating...
mysql_user.sockshop: Creating...
mysql_user.sockshop: Creation complete after 2s [id=catalogue_user@%]
mysql_database.sockshop: Creation complete after 3s [id=socksdb]
mysql_grant.sockshop: Creating...
mysql_grant.sockshop: Creation complete after 1s [id=catalogue_user@%:`socksdb`]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.

Outputs:

cluster_database_name = "demoapps"
cluster_endpoint = "bb-apps-devstg-binbash-aurora-mysql.cluster-ckbbnvlhvanz.us-east-1.rds.amazonaws.com"
cluster_id = "bb-apps-devstg-binbash-aurora-mysql"
cluster_instances = {
  "one" = {
    "apply_immediately" = true
    "arn" = "arn:aws:rds:us-east-1:52XXXXXXXXXXX44:db:bb-apps-devstg-binbash-aurora-mysql-one"
    "auto_minor_version_upgrade" = true
    "availability_zone" = "us-east-1a"
    "ca_cert_identifier" = "rds-ca-2019"
    "cluster_identifier" = "bb-apps-devstg-binbash-aurora-mysql"
    "copy_tags_to_snapshot" = false
    "db_parameter_group_name" = "default.aurora-mysql5.7"
    "db_subnet_group_name" = "bb-apps-devstg-binbash-aurora-mysql"
    "dbi_resource_id" = "db-27L3UXXXXXXXXXXWGFM"
    "endpoint" = "bb-apps-devstg-binbash-aurora-mysql-one.XXXXXXXXXX.us-east-1.rds.amazonaws.com"
    "engine" = "aurora-mysql"
    "engine_version" = "5.7"
    "engine_version_actual" = "5.7.mysql_aurora.2.10.2"
    "id" = "bb-apps-devstg-binbash-aurora-mysql-one"
    "identifier" = "bb-apps-devstg-binbash-aurora-mysql-one"
    "identifier_prefix" = tostring(null)
    "instance_class" = "db.t3.small"
    "kms_key_id" = "arn:aws:kms:us-east-1:52XXXXXXXXXXX44:key/b7a1d5-XXXXXXX-X8eaa1c77"
    "monitoring_interval" = 0
    "monitoring_role_arn" = ""
    "performance_insights_enabled" = false
    "performance_insights_kms_key_id" = ""
    "performance_insights_retention_period" = 0
    "port" = 3306
    "preferred_backup_window" = "14:00-15:00"
    "preferred_maintenance_window" = "sun:05:00-sun:06:00"
    "promotion_tier" = 0
    "publicly_accessible" = false
    "storage_encrypted" = true
    "tags" = tomap({
      "Environment" = "apps-devstg"
      "Name" = "aurora-demo"
      "ScheduleStartDaily" = "true"
      "ScheduleStopDaily" = "true"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "apps-devstg"
      "Name" = "aurora-demo"
      "ScheduleStartDaily" = "true"
      "ScheduleStopDaily" = "true"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
    "writer" = true
  }
}
cluster_master_password = <sensitive>
cluster_master_username = <sensitive>
cluster_port = 3306
cluster_reader_endpoint = "bb-apps-devstg-binbash-aurora-mysql.cluster-ro-ckbbnvlhvanz.us-east-1.rds.amazonaws.com"
cluster_resource_id = "cluster-R7KYXXXXXXXXXUGE"
demoapps_sockshop_database_name = "socksdb"
demoapps_sockshop_password = <sensitive>
demoapps_sockshop_username = "catalogue_user"
security_group_id = "sg-0cXXXXXXXXXXa5"
```